app/controllers/carts_controller.rb

    def set_cart
      begin
        @cart = Cart.find(params[:id])
---
SELECT  "carts".* FROM "carts"  WHERE "carts"."id" = ? LIMIT 1  [["id", 32]]