app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])

    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-07-18 11:27:19.312841"], ["updated_at", "2014-07-18 11:27:19.312841"]]
INSERT INTO "line_items" ("cart_id", "created_at", "price", "product_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 13], ["created_at", "2014-07-21 11:51:51.036050"], ["price", 49.95], ["product_id", 1], ["updated_at", "2014-07-21 11:51:51.036050"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 1  [["quantity", 2], ["updated_at", "2014-07-21 09:31:20.286755"]]